In [28]:
import pandas as pd

In [29]:
data = {
    'transaction_ts': [
        '2024-03-04T02:12:09.000Z', '2024-03-10T08:51:06.000Z', '2024-03-04T14:53:14.000Z',
        '2024-03-09T21:00:29.000Z', '2024-03-01T09:38:51.000Z', '2024-02-12T21:15:38.000Z',
        '2024-02-20T22:44:13.000Z', '2024-02-16T14:14:51.000Z', '2024-02-25T14:24:38.000Z',
        '2024-03-08T10:22:22.000Z', '2024-03-07T17:05:29.000Z', '2024-03-05T12:15:56.000Z',
        '2024-03-13T10:17:06.000Z', '2024-02-27T00:58:57.000Z', '2024-02-21T13:24:23.000Z',
        '2024-02-19T23:35:44.000Z', '2024-03-07T11:09:57.000Z', '2024-02-16T17:32:49.000Z',
        '2024-03-05T19:05:28.000Z', '2024-02-26T04:03:08.000Z', '2024-02-16T21:20:00.000Z',
        '2024-03-02T07:29:57.000Z', '2024-03-04T05:55:39.000Z', '2024-03-03T09:05:36.000Z',
        '2024-02-15T15:33:49.000Z', '2024-02-26T19:49:18.000Z', '2024-03-05T22:53:52.000Z',
        '2024-03-08T21:10:01.000Z', '2024-02-26T01:14:40.000Z', '2024-03-02T17:16:45.000Z',
        '2024-02-16T15:47:38.000Z', '2024-03-07T07:45:29.000Z', '2024-03-09T08:07:55.000Z',
        '2024-02-27T08:30:11.000Z', '2024-02-23T02:19:37.000Z', '2024-03-07T03:55:35.000Z',
        '2024-02-24T13:11:33.000Z', '2024-03-12T14:10:40.000Z', '2024-02-12T22:51:26.000Z',
        '2024-02-29T10:14:15.000Z', '2024-03-06T04:52:28.000Z', '2024-03-02T12:59:18.000Z',
        '2024-02-23T08:21:35.000Z', '2024-02-17T08:19:25.000Z', '2024-02-26T20:41:30.000Z',
        '2024-03-02T07:46:48.000Z', '2024-02-22T08:13:38.000Z', '2024-02-22T11:18:13.000Z',
        '2024-03-05T05:05:21.000Z', '2024-02-25T11:03:16.000Z', '2024-02-14T04:11:05.000Z',
        '2024-03-03T22:49:49.000Z', '2024-02-24T00:10:48.000Z', '2024-02-28T11:48:47.000Z',
        '2024-02-16T15:39:12.000Z', '2024-02-15T17:11:54.000Z', '2024-02-23T10:52:59.000Z',
        '2024-03-07T14:23:03.000Z', '2024-02-16T14:02:59.000Z', '2024-03-02T04:56:38.000Z',
        '2024-02-29T18:14:25.000Z', '2024-02-18T09:21:06.000Z', '2024-03-12T15:28:16.000Z',
        '2024-02-18T13:02:31.000Z', '2024-03-07T14:09:03.000Z', '2024-02-27T04:19:05.000Z',
        '2024-02-18T16:12:49.000Z', '2024-02-22T14:59:20.000Z', '2024-02-28T06:16:11.000Z',
        '2024-02-18T13:32:32.000Z'
    ],
    'user_id': [
        4312667, 8496052, 5545695, 4412678, 5545695, 7027696, 4939867, 7027696, 7027696,
        9603912, 8783745, 5098345, 8557889, 7027696, 4341574, 4412678, 5286808, 8783745,
        4312667, 7568463, 4312667, 7568463, 8557889, 9676738, 7443543, 9109140, 4781860,
        1883712, 5215642, 9109140, 8783745, 9603912, 9603912, 5990422, 5215642, 4341574,
        8496052, 5215642, 7874603, 4939867, 8783745, 5990422, 7027696, 7443543, 8783745,
        5990422, 5990422, 9603912, 5098345, 7443543, 9676738, 4312667, 8496052, 1883712,
        4412678, 7874603, 8584107, 5215642, 7027696, 8496052, 8557889, 4341574, 7027696,
        4412678, 9109140, 5215642, 8783745, 1883712, 1883712, 4341574
    ],
    'transaction_id': [
        2124154420, 6627203372, 3854867536, 7587109181, 7543667832, 1192147809, 3073236862,
        6107847374, 5528255700, 1691280613, 2230954774, 1749384413, 2061233243, 9097829638,
        8601025713, 1906028464, 4451864308, 2400999360, 6233833285, 4660806727, 4572751266,
        1576064705, 1938177502, 1439389905, 6196349214, 1905998921, 1644875033, 9317702068,
        1385568971, 9051336669, 3834568798, 4693723604, 9975977651, 8533989271, 3854686673,
        9283258174, 3497972227, 4607829164, 9815780523, 7249329700, 8449447929, 6132393041,
        4502143467, 9922209712, 3425343232, 9317022506, 1409128207, 6017317405, 6495201074,
        9586576831, 8126825209, 7091398531, 4465581231, 2093975152, 4088712761, 8204223989,
        3284598572, 9878161204, 2167208950, 2957258342, 9073419031, 3101500680, 2866125554,
        3291647384, 9098782163, 4795163640, 2972768883, 4793004101, 6802049580, 2848435855
    ],
    'item': [
        'tie', 'backpack', 'bag', 'book', 'eraser', 'vase', 'tie', 'lamp', 'watch',
        'mirror', 'ruler', 'vase', 'pen', 'pant', 'pen', 'tie', 'cup', 'pencil',
        'ruler', 'bag', 'ruler', 'eraser', 'notebook', 'cup', 'laptop', 'pencil',
        'notebook', 'glove', 'tablet', 'tie', 'vase', 'phone', 'scarf', 'laptop',
        'mirror', 'mirror', 'tablet', 'ruler', 'pen', 'lamp', 'vase', 'ruler',
        'pant', 'lamp', 'backpack', 'vase', 'notebook', 'lamp', 'ruler', 'hat',
        'tablet', 'pencil', 'pencil', 'dress', 'dress', 'book', 'tie', 'backpack',
        'tablet', 'backpack', 'lamp', 'mirror', 'dress', 'eraser', 'phone', 'tablet',
        'bag', 'pant', 'shoe', 'pen'
    ]
}

In [30]:
df = pd.DataFrame(data)
df.head()

             transaction_ts  user_id  transaction_id      item
0  2024-03-04T02:12:09.000Z  4312667      2124154420       tie
1  2024-03-10T08:51:06.000Z  8496052      6627203372  backpack
2  2024-03-04T14:53:14.000Z  5545695      3854867536       bag
3  2024-03-09T21:00:29.000Z  4412678      7587109181      book
4  2024-03-01T09:38:51.000Z  5545695      7543667832    eraser

In [31]:
df['transaction_ts'] = pd.to_datetime(df['transaction_ts'])

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_ts  70 non-null     datetime64[ns, UTC]
 1   user_id         70 non-null     int64
 2   transaction_id  70 non-null     int64
 3   item            70 non-null     object
dtypes: datetime64[ns, UTC](1), int64(2), object(1)
memory usage: 2.3+ KB

In [33]:
df = df.sort_values(by=['user_id', 'transaction_ts'])
df.head()

              transaction_ts  user_id  transaction_id   item
67 2024-02-22 14:59:20+00:00  1883712      4793004101   pant
68 2024-02-28 06:16:11+00:00  1883712      6802049580   shoe
53 2024-02-28 11:48:47+00:00  1883712      2093975152  dress
27 2024-03-08 21:10:01+00:00  1883712      9317702068  glove
20 2024-02-16 21:20:00+00:00  4312667      4572751266  ruler

In [34]:
f_trans = df.groupby('user_id').head(1)
f_trans.head()

              transaction_ts  user_id  transaction_id      item
67 2024-02-22 14:59:20+00:00  1883712      4793004101      pant
20 2024-02-16 21:20:00+00:00  4312667      4572751266     ruler
61 2024-02-18 09:21:06+00:00  4341574      3101500680    mirror
54 2024-02-16 15:39:12+00:00  4412678      4088712761     dress
26 2024-03-05 22:53:52+00:00  4781860      1644875033  notebook

In [35]:
result = f_trans[['user_id', 'item']].reset_index(drop=True)
result

    user_id      item
0   1883712      pant
1   4312667     ruler
2   4341574    mirror
3   4412678     dress
4   4781860  notebook
5   4939867       tie
6   5098345     ruler
7   5215642    mirror
8   5286808       cup
9   5545695    eraser
10  5990422  notebook
11  7027696      vase
12  7443543    laptop
13  7568463       bag
14  7874603       pen
15  8496052    pencil
16  8557889      lamp
17  8584107       tie
18  8783745      vase
19  9109140    pencil
20  9603912      lamp
21  9676738    tablet